#+title:      B Klasse 2023-27
#+date:       [2023-07-08 Sa 14:39]
#+filetags:   :1b:Project:
#+identifier: 20230708T143945
#+CATEGORY: golling

* 1b 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>


* 1b 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>


* 1B [KV Gertraud Viertbauer]
#+Name: 2021-students
| First     | Last          | Name                 | Note | Mitarbeit | Heft | LZK |
|-----------+---------------+----------------------+------+-----------+------+-----|
| Marko     | Davidovic     | [[Marko Davidovic][Marko Davidovic]]      |    1 |           |      |     |
| Elias     | Galler        | [[Elias Galler][Elias Galler]]         |    1 |           |      |     |
| Emma      | Hansmann      | [[Emma Hansmann][Emma Hansmann]]        |    1 |           |      |     |
| Magdalena | Höllbacher    | [[Magdalena Höllbacher][Magdalena Höllbacher]] |    1 |           |      |     |
| Julia     | Höllweger     | [[Julia Höllweger][Julia Höllweger]]      |    1 |           |      |     |
| Rudolf    | Jochinger     | [[Rudolf Jochinger][Rudolf Jochinger]]     |    1 |           |      |     |
| Martin    | Kappacher     | [[Martin Kappacher][Martin Kappacher]]     |    1 |           |      |     |
| Laura     | Klausner      | [[Laura Klausner][Laura Klausner]]       |    1 |           |      |     |
| Sophia    | Korten        | [[Sophia Korten][Sophia Korten]]        |    1 |           |      |     |
| Lisa      | Kronreif      | [[Lisa Kronreif][Lisa Kronreif]]        |    1 |           |      |     |
| Peter     | Kronreif      | [[Peter Kronreif][Peter Kronreif]]       |    1 |           |      |     |
| Anna-Mae  | Leierer       | [[Anna-Mae Leierer][Anna-Mae Leierer]]     |    1 |           |      |     |
| Raphael   | Neureiter     | [[Raphael Neureiter][Raphael Neureiter]]    |    1 |           |      |     |
| Felix     | Putz          | [[Felix Putz][Felix Putz]]           |    1 |           |      |     |
| Klara     | Schmitzberger | [[Klara Schmitzberger][Klara Schmitzberger]]  |    1 |           |      |     |
| Elisabeth | Seigmann      | [[Elisabeth Seigmann][Elisabeth Seigmann]]   |    1 |           |      |     |
| Bianca    | Spagolla      | [[Bianca Spagolla][Bianca Spagolla]]      |    1 |           |      |     |
| Ilija     | Zivkovic      | [[Ilija Zivkovic][Ilija Zivkovic]]       |      |           |      |     |
|-----------+---------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':END: ')
      print('\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                 | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 |
|----------------------+------+---+---+---+---+---+---+---+---+---+----+----|
| [[Marko Davidovic][Marko Davidovic]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Elias Galler][Elias Galler]]         |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Emma Hansmann][Emma Hansmann]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Magdalena Höllbacher][Magdalena Höllbacher]] |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Julia Höllweger][Julia Höllweger]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Rudolf Jochinger][Rudolf Jochinger]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Martin Kappacher][Martin Kappacher]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Laura Klausner][Laura Klausner]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Sophia Korten][Sophia Korten]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Lisa Kronreif][Lisa Kronreif]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Peter Kronreif][Peter Kronreif]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Anna-Mae Leierer][Anna-Mae Leierer]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Raphael Neureiter][Raphael Neureiter]]    |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Felix Putz][Felix Putz]]           |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Klara Schmitzberger][Klara Schmitzberger]]  |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Elisabeth Seigmann][Elisabeth Seigmann]]   |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Bianca Spagolla][Bianca Spagolla]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Ilija Zivkovic][Ilija Zivkovic]]       |      |   |   |   |   |   |   |   |   |   |    |    |
#+TBLFM: $2=vmean($3..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

** Marko Davidovic
:PROPERTIES:
:EMAIL: [[mailto: Marko Davidovic <Marko.Davidovic@golling.schule>]]
:END: 



** Elias Galler
:PROPERTIES:
:EMAIL: [[mailto: Elias Galler <Elias.Galler@golling.schule>]]
:END: 



** Emma Hansmann
:PROPERTIES:
:EMAIL: [[mailto: Emma Hansmann <Emma.Hansmann@golling.schule>]]
:END: 



** Magdalena Höllbacher
:PROPERTIES:
:EMAIL: [[mailto: Magdalena Höllbacher <Magdalena.Höllbacher@golling.schule>]]
:END: 



** Julia Höllweger
:PROPERTIES:
:EMAIL: [[mailto: Julia Höllweger <Julia.Höllweger@golling.schule>]]
:END: 



** Rudolf Jochinger
:PROPERTIES:
:EMAIL: [[mailto: Rudolf Jochinger <Rudolf.Jochinger@golling.schule>]]
:END: 



** Martin Kappacher
:PROPERTIES:
:EMAIL: [[mailto: Martin Kappacher <Martin.Kappacher@golling.schule>]]
:END: 



** Laura Klausner
:PROPERTIES:
:EMAIL: [[mailto: Laura Klausner <Laura.Klausner@golling.schule>]]
:END: 



** Sophia Korten
:PROPERTIES:
:EMAIL: [[mailto: Sophia Korten <Sophia.Korten@golling.schule>]]
:END: 



** Lisa Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Lisa Kronreif <Lisa.Kronreif@golling.schule>]]
:END: 



** Peter Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Peter Kronreif <Peter.Kronreif@golling.schule>]]
:END: 



** Anna-Mae Leierer
:PROPERTIES:
:EMAIL: [[mailto: Anna-Mae Leierer <Anna-Mae.Leierer@golling.schule>]]
:END: 



** Raphael Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Raphael Neureiter <Raphael.Neureiter@golling.schule>]]
:END: 



** Felix Putz
:PROPERTIES:
:EMAIL: [[mailto: Felix Putz <Felix.Putz@golling.schule>]]
:END:

*** Fragen zu [[denote:20230619T074058][[SW03] Was ich mir zutraue / Kann ich dir vertrauen?]]
:PROPERTIES:
:CAPTURED: [2023-08-11 Fr 23:38]
:END:

Felix hat zu (Thema) in der ersten Stunde am Samstag folgende interessante Fragen gestellt:
- Frage 1
- Frage 2
  
*** Mitarbeit
:PROPERTIES:
:CAPTURED: [2023-08-12 Sa 07:45]
:END:

Seine Mitarbeit ist klasse.

*** Fragen
:PROPERTIES:
:CAPTURED: [2023-08-12 Sa 07:45]
:END:

Test test

*** Verhalten
:PROPERTIES:
:CAPTURED: [2023-08-12 Sa 00:13]
:CLASS: 1b 07:45-08:35
:END:

Felix ist seinen Mitschülern gegenüber sehr hilfsbereit.

*** Heft...
:PROPERTIES:
:CAPTURED: [2023-08-12 Sa 00:23]
:CLASS: [2023-08-12 Sa 07:45]--[2023-08-12 Sa 08:35]
:END:

... sieht toll aus.

*** Fragen zu 
:PROPERTIES:
:CAPTURED: [2023-08-12 Sa 18:48]
:CLASS: [2023-08-12 Sa 07:45] 1. Stunde
:END:

Hm, wie sieht das aus?


** Klara Schmitzberger
:PROPERTIES:
:EMAIL: [[mailto: Klara Schmitzberger <Klara.Schmitzberger@golling.schule>]]
:END: 



** Elisabeth Seigmann
:PROPERTIES:
:EMAIL: [[mailto: Elisabeth Seigmann <Elisabeth.Seigmann@golling.schule>]]
:END: 



** Bianca Spagolla
:PROPERTIES:
:EMAIL: [[mailto: Bianca Spagolla <Bianca.Spagolla@golling.schule>]]
:END: 



** Ilija Zivkovic
:PROPERTIES:
:EMAIL: [[mailto: Ilija Zivkovic <Ilija.Zivkovic@golling.schule>]]
:END: 





* Reflexionen

